{"modelTopology":{"class_name":"Sequential","config":{"name":"sequential_4","layers":[{"class_name":"Sequential","config":{"name":"sequential_1","layers":[{"class_name":"Model","config":{"name":"model1","layers":[{"name":"conv2d_27_input","class_name":"InputLayer","config":{"batch_input_shape":[null,96,96,1],"dtype":"float32","sparse":false,"name":"conv2d_27_input"},"inbound_nodes":[]},{"name":"conv2d_27","class_name":"Conv2D","config":{"filters":8,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.009999999776482582}},"kernel_constraint":null,"kernel_size":[3,3],"strides":[2,2],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_27","trainable":true,"batch_input_shape":[null,96,96,1],"dtype":"float32"},"inbound_nodes":[[["conv2d_27_input",0,0,{}]]]},{"name":"batch_normalization_52","class_name":"BatchNormalization","config":{"axis":[3],"momentum":0.9997,"epsilon":0.0010000000474974513,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_52","trainable":true},"inbound_nodes":[[["conv2d_27",0,0,{}]]]},{"name":"re_lu_52","class_name":"ReLU","config":{"max_value":6,"name":"re_lu_52","trainable":true},"inbound_nodes":[[["batch_normalization_52",0,0,{}]]]},{"name":"depthwise_conv2d_26","class_name":"DepthwiseConv2D","config":{"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"depthwise_conv2d_26","trainable":true,"depth_multiplier":1,"depthwise_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"depthwise_regularizer":null,"depthwise_constraint":null},"inbound_nodes":[[["re_lu_52",0,0,{}]]]},{"name":"batch_normalization_53","class_name":"BatchNormalization","config":{"axis":[3],"momentum":0.9997,"epsilon":0.0010000000474974513,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_53","trainable":true},"inbound_nodes":[[["depthwise_conv2d_26",0,0,{}]]]},{"name":"re_lu_53","class_name":"ReLU","config":{"max_value":6,"name":"re_lu_53","trainable":true},"inbound_nodes":[[["batch_normalization_53",0,0,{}]]]},{"name":"conv2d_28","class_name":"Conv2D","config":{"filters":16,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.009999999776482582}},"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_28","trainable":true},"inbound_nodes":[[["re_lu_53",0,0,{}]]]},{"name":"batch_normalization_54","class_name":"BatchNormalization","config":{"axis":[3],"momentum":0.9997,"epsilon":0.0010000000474974513,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_54","trainable":true},"inbound_nodes":[[["conv2d_28",0,0,{}]]]},{"name":"re_lu_54","class_name":"ReLU","config":{"max_value":6,"name":"re_lu_54","trainable":true},"inbound_nodes":[[["batch_normalization_54",0,0,{}]]]},{"name":"depthwise_conv2d_27","class_name":"DepthwiseConv2D","config":{"kernel_size":[3,3],"strides":[2,2],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"depthwise_conv2d_27","trainable":true,"depth_multiplier":1,"depthwise_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"depthwise_regularizer":null,"depthwise_constraint":null},"inbound_nodes":[[["re_lu_54",0,0,{}]]]},{"name":"batch_normalization_55","class_name":"BatchNormalization","config":{"axis":[3],"momentum":0.9997,"epsilon":0.0010000000474974513,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_55","trainable":true},"inbound_nodes":[[["depthwise_conv2d_27",0,0,{}]]]},{"name":"re_lu_55","class_name":"ReLU","config":{"max_value":6,"name":"re_lu_55","trainable":true},"inbound_nodes":[[["batch_normalization_55",0,0,{}]]]},{"name":"conv2d_29","class_name":"Conv2D","config":{"filters":32,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.009999999776482582}},"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_29","trainable":true},"inbound_nodes":[[["re_lu_55",0,0,{}]]]},{"name":"batch_normalization_56","class_name":"BatchNormalization","config":{"axis":[3],"momentum":0.9997,"epsilon":0.0010000000474974513,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_56","trainable":true},"inbound_nodes":[[["conv2d_29",0,0,{}]]]},{"name":"re_lu_56","class_name":"ReLU","config":{"max_value":6,"name":"re_lu_56","trainable":true},"inbound_nodes":[[["batch_normalization_56",0,0,{}]]]},{"name":"depthwise_conv2d_28","class_name":"DepthwiseConv2D","config":{"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"depthwise_conv2d_28","trainable":true,"depth_multiplier":1,"depthwise_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"depthwise_regularizer":null,"depthwise_constraint":null},"inbound_nodes":[[["re_lu_56",0,0,{}]]]},{"name":"batch_normalization_57","class_name":"BatchNormalization","config":{"axis":[3],"momentum":0.9997,"epsilon":0.0010000000474974513,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_57","trainable":true},"inbound_nodes":[[["depthwise_conv2d_28",0,0,{}]]]},{"name":"re_lu_57","class_name":"ReLU","config":{"max_value":6,"name":"re_lu_57","trainable":true},"inbound_nodes":[[["batch_normalization_57",0,0,{}]]]},{"name":"conv2d_30","class_name":"Conv2D","config":{"filters":32,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.009999999776482582}},"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_30","trainable":true},"inbound_nodes":[[["re_lu_57",0,0,{}]]]},{"name":"batch_normalization_58","class_name":"BatchNormalization","config":{"axis":[3],"momentum":0.9997,"epsilon":0.0010000000474974513,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_58","trainable":true},"inbound_nodes":[[["conv2d_30",0,0,{}]]]},{"name":"re_lu_58","class_name":"ReLU","config":{"max_value":6,"name":"re_lu_58","trainable":true},"inbound_nodes":[[["batch_normalization_58",0,0,{}]]]},{"name":"depthwise_conv2d_29","class_name":"DepthwiseConv2D","config":{"kernel_size":[3,3],"strides":[2,2],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"depthwise_conv2d_29","trainable":true,"depth_multiplier":1,"depthwise_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"depthwise_regularizer":null,"depthwise_constraint":null},"inbound_nodes":[[["re_lu_58",0,0,{}]]]},{"name":"batch_normalization_59","class_name":"BatchNormalization","config":{"axis":[3],"momentum":0.9997,"epsilon":0.0010000000474974513,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_59","trainable":true},"inbound_nodes":[[["depthwise_conv2d_29",0,0,{}]]]},{"name":"re_lu_59","class_name":"ReLU","config":{"max_value":6,"name":"re_lu_59","trainable":true},"inbound_nodes":[[["batch_normalization_59",0,0,{}]]]},{"name":"conv2d_31","class_name":"Conv2D","config":{"filters":64,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.009999999776482582}},"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_31","trainable":true},"inbound_nodes":[[["re_lu_59",0,0,{}]]]},{"name":"batch_normalization_60","class_name":"BatchNormalization","config":{"axis":[3],"momentum":0.9997,"epsilon":0.0010000000474974513,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_60","trainable":true},"inbound_nodes":[[["conv2d_31",0,0,{}]]]},{"name":"re_lu_60","class_name":"ReLU","config":{"max_value":6,"name":"re_lu_60","trainable":true},"inbound_nodes":[[["batch_normalization_60",0,0,{}]]]},{"name":"depthwise_conv2d_30","class_name":"DepthwiseConv2D","config":{"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"depthwise_conv2d_30","trainable":true,"depth_multiplier":1,"depthwise_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"depthwise_regularizer":null,"depthwise_constraint":null},"inbound_nodes":[[["re_lu_60",0,0,{}]]]},{"name":"batch_normalization_61","class_name":"BatchNormalization","config":{"axis":[3],"momentum":0.9997,"epsilon":0.0010000000474974513,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_61","trainable":true},"inbound_nodes":[[["depthwise_conv2d_30",0,0,{}]]]},{"name":"re_lu_61","class_name":"ReLU","config":{"max_value":6,"name":"re_lu_61","trainable":true},"inbound_nodes":[[["batch_normalization_61",0,0,{}]]]},{"name":"conv2d_32","class_name":"Conv2D","config":{"filters":64,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.009999999776482582}},"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_32","trainable":true},"inbound_nodes":[[["re_lu_61",0,0,{}]]]},{"name":"batch_normalization_62","class_name":"BatchNormalization","config":{"axis":[3],"momentum":0.9997,"epsilon":0.0010000000474974513,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_62","trainable":true},"inbound_nodes":[[["conv2d_32",0,0,{}]]]},{"name":"re_lu_62","class_name":"ReLU","config":{"max_value":6,"name":"re_lu_62","trainable":true},"inbound_nodes":[[["batch_normalization_62",0,0,{}]]]},{"name":"depthwise_conv2d_31","class_name":"DepthwiseConv2D","config":{"kernel_size":[3,3],"strides":[2,2],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"depthwise_conv2d_31","trainable":true,"depth_multiplier":1,"depthwise_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"depthwise_regularizer":null,"depthwise_constraint":null},"inbound_nodes":[[["re_lu_62",0,0,{}]]]},{"name":"batch_normalization_63","class_name":"BatchNormalization","config":{"axis":[3],"momentum":0.9997,"epsilon":0.0010000000474974513,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_63","trainable":true},"inbound_nodes":[[["depthwise_conv2d_31",0,0,{}]]]},{"name":"re_lu_63","class_name":"ReLU","config":{"max_value":6,"name":"re_lu_63","trainable":true},"inbound_nodes":[[["batch_normalization_63",0,0,{}]]]},{"name":"conv2d_33","class_name":"Conv2D","config":{"filters":128,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.009999999776482582}},"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_33","trainable":true},"inbound_nodes":[[["re_lu_63",0,0,{}]]]},{"name":"batch_normalization_64","class_name":"BatchNormalization","config":{"axis":[3],"momentum":0.9997,"epsilon":0.0010000000474974513,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_64","trainable":true},"inbound_nodes":[[["conv2d_33",0,0,{}]]]},{"name":"re_lu_64","class_name":"ReLU","config":{"max_value":6,"name":"re_lu_64","trainable":true},"inbound_nodes":[[["batch_normalization_64",0,0,{}]]]},{"name":"depthwise_conv2d_32","class_name":"DepthwiseConv2D","config":{"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"depthwise_conv2d_32","trainable":true,"depth_multiplier":1,"depthwise_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"depthwise_regularizer":null,"depthwise_constraint":null},"inbound_nodes":[[["re_lu_64",0,0,{}]]]},{"name":"batch_normalization_65","class_name":"BatchNormalization","config":{"axis":[3],"momentum":0.9997,"epsilon":0.0010000000474974513,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_65","trainable":true},"inbound_nodes":[[["depthwise_conv2d_32",0,0,{}]]]},{"name":"re_lu_65","class_name":"ReLU","config":{"max_value":6,"name":"re_lu_65","trainable":true},"inbound_nodes":[[["batch_normalization_65",0,0,{}]]]},{"name":"conv2d_34","class_name":"Conv2D","config":{"filters":128,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.009999999776482582}},"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_34","trainable":true},"inbound_nodes":[[["re_lu_65",0,0,{}]]]},{"name":"batch_normalization_66","class_name":"BatchNormalization","config":{"axis":[3],"momentum":0.9997,"epsilon":0.0010000000474974513,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_66","trainable":true},"inbound_nodes":[[["conv2d_34",0,0,{}]]]},{"name":"re_lu_66","class_name":"ReLU","config":{"max_value":6,"name":"re_lu_66","trainable":true},"inbound_nodes":[[["batch_normalization_66",0,0,{}]]]},{"name":"depthwise_conv2d_33","class_name":"DepthwiseConv2D","config":{"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"depthwise_conv2d_33","trainable":true,"depth_multiplier":1,"depthwise_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"depthwise_regularizer":null,"depthwise_constraint":null},"inbound_nodes":[[["re_lu_66",0,0,{}]]]},{"name":"batch_normalization_67","class_name":"BatchNormalization","config":{"axis":[3],"momentum":0.9997,"epsilon":0.0010000000474974513,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_67","trainable":true},"inbound_nodes":[[["depthwise_conv2d_33",0,0,{}]]]},{"name":"re_lu_67","class_name":"ReLU","config":{"max_value":6,"name":"re_lu_67","trainable":true},"inbound_nodes":[[["batch_normalization_67",0,0,{}]]]},{"name":"conv2d_35","class_name":"Conv2D","config":{"filters":128,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.009999999776482582}},"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_35","trainable":true},"inbound_nodes":[[["re_lu_67",0,0,{}]]]},{"name":"batch_normalization_68","class_name":"BatchNormalization","config":{"axis":[3],"momentum":0.9997,"epsilon":0.0010000000474974513,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_68","trainable":true},"inbound_nodes":[[["conv2d_35",0,0,{}]]]},{"name":"re_lu_68","class_name":"ReLU","config":{"max_value":6,"name":"re_lu_68","trainable":true},"inbound_nodes":[[["batch_normalization_68",0,0,{}]]]},{"name":"depthwise_conv2d_34","class_name":"DepthwiseConv2D","config":{"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"depthwise_conv2d_34","trainable":true,"depth_multiplier":1,"depthwise_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"depthwise_regularizer":null,"depthwise_constraint":null},"inbound_nodes":[[["re_lu_68",0,0,{}]]]},{"name":"batch_normalization_69","class_name":"BatchNormalization","config":{"axis":[3],"momentum":0.9997,"epsilon":0.0010000000474974513,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_69","trainable":true},"inbound_nodes":[[["depthwise_conv2d_34",0,0,{}]]]},{"name":"re_lu_69","class_name":"ReLU","config":{"max_value":6,"name":"re_lu_69","trainable":true},"inbound_nodes":[[["batch_normalization_69",0,0,{}]]]},{"name":"conv2d_36","class_name":"Conv2D","config":{"filters":128,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.009999999776482582}},"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_36","trainable":true},"inbound_nodes":[[["re_lu_69",0,0,{}]]]},{"name":"batch_normalization_70","class_name":"BatchNormalization","config":{"axis":[3],"momentum":0.9997,"epsilon":0.0010000000474974513,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_70","trainable":true},"inbound_nodes":[[["conv2d_36",0,0,{}]]]},{"name":"re_lu_70","class_name":"ReLU","config":{"max_value":6,"name":"re_lu_70","trainable":true},"inbound_nodes":[[["batch_normalization_70",0,0,{}]]]},{"name":"depthwise_conv2d_35","class_name":"DepthwiseConv2D","config":{"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"depthwise_conv2d_35","trainable":true,"depth_multiplier":1,"depthwise_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"depthwise_regularizer":null,"depthwise_constraint":null},"inbound_nodes":[[["re_lu_70",0,0,{}]]]},{"name":"batch_normalization_71","class_name":"BatchNormalization","config":{"axis":[3],"momentum":0.9997,"epsilon":0.0010000000474974513,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_71","trainable":true},"inbound_nodes":[[["depthwise_conv2d_35",0,0,{}]]]},{"name":"re_lu_71","class_name":"ReLU","config":{"max_value":6,"name":"re_lu_71","trainable":true},"inbound_nodes":[[["batch_normalization_71",0,0,{}]]]},{"name":"conv2d_37","class_name":"Conv2D","config":{"filters":128,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.009999999776482582}},"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_37","trainable":true},"inbound_nodes":[[["re_lu_71",0,0,{}]]]},{"name":"batch_normalization_72","class_name":"BatchNormalization","config":{"axis":[3],"momentum":0.9997,"epsilon":0.0010000000474974513,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_72","trainable":true},"inbound_nodes":[[["conv2d_37",0,0,{}]]]},{"name":"re_lu_72","class_name":"ReLU","config":{"max_value":6,"name":"re_lu_72","trainable":true},"inbound_nodes":[[["batch_normalization_72",0,0,{}]]]},{"name":"depthwise_conv2d_36","class_name":"DepthwiseConv2D","config":{"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"depthwise_conv2d_36","trainable":true,"depth_multiplier":1,"depthwise_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"depthwise_regularizer":null,"depthwise_constraint":null},"inbound_nodes":[[["re_lu_72",0,0,{}]]]},{"name":"batch_normalization_73","class_name":"BatchNormalization","config":{"axis":[3],"momentum":0.9997,"epsilon":0.0010000000474974513,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_73","trainable":true},"inbound_nodes":[[["depthwise_conv2d_36",0,0,{}]]]},{"name":"re_lu_73","class_name":"ReLU","config":{"max_value":6,"name":"re_lu_73","trainable":true},"inbound_nodes":[[["batch_normalization_73",0,0,{}]]]},{"name":"conv2d_38","class_name":"Conv2D","config":{"filters":128,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.009999999776482582}},"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_38","trainable":true},"inbound_nodes":[[["re_lu_73",0,0,{}]]]},{"name":"batch_normalization_74","class_name":"BatchNormalization","config":{"axis":[3],"momentum":0.9997,"epsilon":0.0010000000474974513,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_74","trainable":true},"inbound_nodes":[[["conv2d_38",0,0,{}]]]},{"name":"re_lu_74","class_name":"ReLU","config":{"max_value":6,"name":"re_lu_74","trainable":true},"inbound_nodes":[[["batch_normalization_74",0,0,{}]]]},{"name":"depthwise_conv2d_37","class_name":"DepthwiseConv2D","config":{"kernel_size":[3,3],"strides":[2,2],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"depthwise_conv2d_37","trainable":true,"depth_multiplier":1,"depthwise_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"depthwise_regularizer":null,"depthwise_constraint":null},"inbound_nodes":[[["re_lu_74",0,0,{}]]]},{"name":"batch_normalization_75","class_name":"BatchNormalization","config":{"axis":[3],"momentum":0.9997,"epsilon":0.0010000000474974513,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_75","trainable":true},"inbound_nodes":[[["depthwise_conv2d_37",0,0,{}]]]},{"name":"re_lu_75","class_name":"ReLU","config":{"max_value":6,"name":"re_lu_75","trainable":true},"inbound_nodes":[[["batch_normalization_75",0,0,{}]]]},{"name":"conv2d_39","class_name":"Conv2D","config":{"filters":256,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.009999999776482582}},"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_39","trainable":true},"inbound_nodes":[[["re_lu_75",0,0,{}]]]},{"name":"batch_normalization_76","class_name":"BatchNormalization","config":{"axis":[3],"momentum":0.9997,"epsilon":0.0010000000474974513,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_76","trainable":true},"inbound_nodes":[[["conv2d_39",0,0,{}]]]},{"name":"re_lu_76","class_name":"ReLU","config":{"max_value":6,"name":"re_lu_76","trainable":true},"inbound_nodes":[[["batch_normalization_76",0,0,{}]]]},{"name":"depthwise_conv2d_38","class_name":"DepthwiseConv2D","config":{"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"depthwise_conv2d_38","trainable":true,"depth_multiplier":1,"depthwise_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"depthwise_regularizer":null,"depthwise_constraint":null},"inbound_nodes":[[["re_lu_76",0,0,{}]]]},{"name":"batch_normalization_77","class_name":"BatchNormalization","config":{"axis":[3],"momentum":0.9997,"epsilon":0.0010000000474974513,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_77","trainable":true},"inbound_nodes":[[["depthwise_conv2d_38",0,0,{}]]]},{"name":"re_lu_77","class_name":"ReLU","config":{"max_value":6,"name":"re_lu_77","trainable":true},"inbound_nodes":[[["batch_normalization_77",0,0,{}]]]},{"name":"conv_pw_13_relu","class_name":"Conv2D","config":{"filters":256,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.009999999776482582}},"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":false,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv_pw_13_relu","trainable":true},"inbound_nodes":[[["re_lu_77",0,0,{}]]]}],"input_layers":[["conv2d_27_input",0,0]],"output_layers":[["conv_pw_13_relu",0,0]]}},{"class_name":"Flatten","config":{"name":"flatten_Flatten1","trainable":true}}]}},{"class_name":"Sequential","config":{"name":"sequential_3","layers":[{"class_name":"Dense","config":{"units":100,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_in","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1","trainable":true,"batch_input_shape":[null,2304],"dtype":"float32"}},{"class_name":"Dense","config":{"units":2,"activation":"softmax","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_in","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2","trainable":true}}]}}]},"keras_version":"tfjs-layers 1.3.1","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"conv2d_27/kernel","shape":[3,3,1,8],"dtype":"float32"},{"name":"batch_normalization_52/gamma","shape":[8],"dtype":"float32"},{"name":"batch_normalization_52/beta","shape":[8],"dtype":"float32"},{"name":"depthwise_conv2d_26/depthwise_kernel","shape":[3,3,8,1],"dtype":"float32"},{"name":"batch_normalization_53/gamma","shape":[8],"dtype":"float32"},{"name":"batch_normalization_53/beta","shape":[8],"dtype":"float32"},{"name":"conv2d_28/kernel","shape":[1,1,8,16],"dtype":"float32"},{"name":"batch_normalization_54/gamma","shape":[16],"dtype":"float32"},{"name":"batch_normalization_54/beta","shape":[16],"dtype":"float32"},{"name":"depthwise_conv2d_27/depthwise_kernel","shape":[3,3,16,1],"dtype":"float32"},{"name":"batch_normalization_55/gamma","shape":[16],"dtype":"float32"},{"name":"batch_normalization_55/beta","shape":[16],"dtype":"float32"},{"name":"conv2d_29/kernel","shape":[1,1,16,32],"dtype":"float32"},{"name":"batch_normalization_56/gamma","shape":[32],"dtype":"float32"},{"name":"batch_normalization_56/beta","shape":[32],"dtype":"float32"},{"name":"depthwise_conv2d_28/depthwise_kernel","shape":[3,3,32,1],"dtype":"float32"},{"name":"batch_normalization_57/gamma","shape":[32],"dtype":"float32"},{"name":"batch_normalization_57/beta","shape":[32],"dtype":"float32"},{"name":"conv2d_30/kernel","shape":[1,1,32,32],"dtype":"float32"},{"name":"batch_normalization_58/gamma","shape":[32],"dtype":"float32"},{"name":"batch_normalization_58/beta","shape":[32],"dtype":"float32"},{"name":"depthwise_conv2d_29/depthwise_kernel","shape":[3,3,32,1],"dtype":"float32"},{"name":"batch_normalization_59/gamma","shape":[32],"dtype":"float32"},{"name":"batch_normalization_59/beta","shape":[32],"dtype":"float32"},{"name":"conv2d_31/kernel","shape":[1,1,32,64],"dtype":"float32"},{"name":"batch_normalization_60/gamma","shape":[64],"dtype":"float32"},{"name":"batch_normalization_60/beta","shape":[64],"dtype":"float32"},{"name":"depthwise_conv2d_30/depthwise_kernel","shape":[3,3,64,1],"dtype":"float32"},{"name":"batch_normalization_61/gamma","shape":[64],"dtype":"float32"},{"name":"batch_normalization_61/beta","shape":[64],"dtype":"float32"},{"name":"conv2d_32/kernel","shape":[1,1,64,64],"dtype":"float32"},{"name":"batch_normalization_62/gamma","shape":[64],"dtype":"float32"},{"name":"batch_normalization_62/beta","shape":[64],"dtype":"float32"},{"name":"depthwise_conv2d_31/depthwise_kernel","shape":[3,3,64,1],"dtype":"float32"},{"name":"batch_normalization_63/gamma","shape":[64],"dtype":"float32"},{"name":"batch_normalization_63/beta","shape":[64],"dtype":"float32"},{"name":"conv2d_33/kernel","shape":[1,1,64,128],"dtype":"float32"},{"name":"batch_normalization_64/gamma","shape":[128],"dtype":"float32"},{"name":"batch_normalization_64/beta","shape":[128],"dtype":"float32"},{"name":"depthwise_conv2d_32/depthwise_kernel","shape":[3,3,128,1],"dtype":"float32"},{"name":"batch_normalization_65/gamma","shape":[128],"dtype":"float32"},{"name":"batch_normalization_65/beta","shape":[128],"dtype":"float32"},{"name":"conv2d_34/kernel","shape":[1,1,128,128],"dtype":"float32"},{"name":"batch_normalization_66/gamma","shape":[128],"dtype":"float32"},{"name":"batch_normalization_66/beta","shape":[128],"dtype":"float32"},{"name":"depthwise_conv2d_33/depthwise_kernel","shape":[3,3,128,1],"dtype":"float32"},{"name":"batch_normalization_67/gamma","shape":[128],"dtype":"float32"},{"name":"batch_normalization_67/beta","shape":[128],"dtype":"float32"},{"name":"conv2d_35/kernel","shape":[1,1,128,128],"dtype":"float32"},{"name":"batch_normalization_68/gamma","shape":[128],"dtype":"float32"},{"name":"batch_normalization_68/beta","shape":[128],"dtype":"float32"},{"name":"depthwise_conv2d_34/depthwise_kernel","shape":[3,3,128,1],"dtype":"float32"},{"name":"batch_normalization_69/gamma","shape":[128],"dtype":"float32"},{"name":"batch_normalization_69/beta","shape":[128],"dtype":"float32"},{"name":"conv2d_36/kernel","shape":[1,1,128,128],"dtype":"float32"},{"name":"batch_normalization_70/gamma","shape":[128],"dtype":"float32"},{"name":"batch_normalization_70/beta","shape":[128],"dtype":"float32"},{"name":"depthwise_conv2d_35/depthwise_kernel","shape":[3,3,128,1],"dtype":"float32"},{"name":"batch_normalization_71/gamma","shape":[128],"dtype":"float32"},{"name":"batch_normalization_71/beta","shape":[128],"dtype":"float32"},{"name":"conv2d_37/kernel","shape":[1,1,128,128],"dtype":"float32"},{"name":"batch_normalization_72/gamma","shape":[128],"dtype":"float32"},{"name":"batch_normalization_72/beta","shape":[128],"dtype":"float32"},{"name":"depthwise_conv2d_36/depthwise_kernel","shape":[3,3,128,1],"dtype":"float32"},{"name":"batch_normalization_73/gamma","shape":[128],"dtype":"float32"},{"name":"batch_normalization_73/beta","shape":[128],"dtype":"float32"},{"name":"conv2d_38/kernel","shape":[1,1,128,128],"dtype":"float32"},{"name":"batch_normalization_74/gamma","shape":[128],"dtype":"float32"},{"name":"batch_normalization_74/beta","shape":[128],"dtype":"float32"},{"name":"depthwise_conv2d_37/depthwise_kernel","shape":[3,3,128,1],"dtype":"float32"},{"name":"batch_normalization_75/gamma","shape":[128],"dtype":"float32"},{"name":"batch_normalization_75/beta","shape":[128],"dtype":"float32"},{"name":"conv2d_39/kernel","shape":[1,1,128,256],"dtype":"float32"},{"name":"batch_normalization_76/gamma","shape":[256],"dtype":"float32"},{"name":"batch_normalization_76/beta","shape":[256],"dtype":"float32"},{"name":"depthwise_conv2d_38/depthwise_kernel","shape":[3,3,256,1],"dtype":"float32"},{"name":"batch_normalization_77/gamma","shape":[256],"dtype":"float32"},{"name":"batch_normalization_77/beta","shape":[256],"dtype":"float32"},{"name":"conv_pw_13_relu/kernel","shape":[1,1,256,256],"dtype":"float32"},{"name":"dense_Dense1/kernel","shape":[2304,100],"dtype":"float32"},{"name":"dense_Dense1/bias","shape":[100],"dtype":"float32"},{"name":"dense_Dense2/kernel","shape":[100,2],"dtype":"float32"},{"name":"batch_normalization_52/moving_mean","shape":[8],"dtype":"float32"},{"name":"batch_normalization_52/moving_variance","shape":[8],"dtype":"float32"},{"name":"batch_normalization_53/moving_mean","shape":[8],"dtype":"float32"},{"name":"batch_normalization_53/moving_variance","shape":[8],"dtype":"float32"},{"name":"batch_normalization_54/moving_mean","shape":[16],"dtype":"float32"},{"name":"batch_normalization_54/moving_variance","shape":[16],"dtype":"float32"},{"name":"batch_normalization_55/moving_mean","shape":[16],"dtype":"float32"},{"name":"batch_normalization_55/moving_variance","shape":[16],"dtype":"float32"},{"name":"batch_normalization_56/moving_mean","shape":[32],"dtype":"float32"},{"name":"batch_normalization_56/moving_variance","shape":[32],"dtype":"float32"},{"name":"batch_normalization_57/moving_mean","shape":[32],"dtype":"float32"},{"name":"batch_normalization_57/moving_variance","shape":[32],"dtype":"float32"},{"name":"batch_normalization_58/moving_mean","shape":[32],"dtype":"float32"},{"name":"batch_normalization_58/moving_variance","shape":[32],"dtype":"float32"},{"name":"batch_normalization_59/moving_mean","shape":[32],"dtype":"float32"},{"name":"batch_normalization_59/moving_variance","shape":[32],"dtype":"float32"},{"name":"batch_normalization_60/moving_mean","shape":[64],"dtype":"float32"},{"name":"batch_normalization_60/moving_variance","shape":[64],"dtype":"float32"},{"name":"batch_normalization_61/moving_mean","shape":[64],"dtype":"float32"},{"name":"batch_normalization_61/moving_variance","shape":[64],"dtype":"float32"},{"name":"batch_normalization_62/moving_mean","shape":[64],"dtype":"float32"},{"name":"batch_normalization_62/moving_variance","shape":[64],"dtype":"float32"},{"name":"batch_normalization_63/moving_mean","shape":[64],"dtype":"float32"},{"name":"batch_normalization_63/moving_variance","shape":[64],"dtype":"float32"},{"name":"batch_normalization_64/moving_mean","shape":[128],"dtype":"float32"},{"name":"batch_normalization_64/moving_variance","shape":[128],"dtype":"float32"},{"name":"batch_normalization_65/moving_mean","shape":[128],"dtype":"float32"},{"name":"batch_normalization_65/moving_variance","shape":[128],"dtype":"float32"},{"name":"batch_normalization_66/moving_mean","shape":[128],"dtype":"float32"},{"name":"batch_normalization_66/moving_variance","shape":[128],"dtype":"float32"},{"name":"batch_normalization_67/moving_mean","shape":[128],"dtype":"float32"},{"name":"batch_normalization_67/moving_variance","shape":[128],"dtype":"float32"},{"name":"batch_normalization_68/moving_mean","shape":[128],"dtype":"float32"},{"name":"batch_normalization_68/moving_variance","shape":[128],"dtype":"float32"},{"name":"batch_normalization_69/moving_mean","shape":[128],"dtype":"float32"},{"name":"batch_normalization_69/moving_variance","shape":[128],"dtype":"float32"},{"name":"batch_normalization_70/moving_mean","shape":[128],"dtype":"float32"},{"name":"batch_normalization_70/moving_variance","shape":[128],"dtype":"float32"},{"name":"batch_normalization_71/moving_mean","shape":[128],"dtype":"float32"},{"name":"batch_normalization_71/moving_variance","shape":[128],"dtype":"float32"},{"name":"batch_normalization_72/moving_mean","shape":[128],"dtype":"float32"},{"name":"batch_normalization_72/moving_variance","shape":[128],"dtype":"float32"},{"name":"batch_normalization_73/moving_mean","shape":[128],"dtype":"float32"},{"name":"batch_normalization_73/moving_variance","shape":[128],"dtype":"float32"},{"name":"batch_normalization_74/moving_mean","shape":[128],"dtype":"float32"},{"name":"batch_normalization_74/moving_variance","shape":[128],"dtype":"float32"},{"name":"batch_normalization_75/moving_mean","shape":[128],"dtype":"float32"},{"name":"batch_normalization_75/moving_variance","shape":[128],"dtype":"float32"},{"name":"batch_normalization_76/moving_mean","shape":[256],"dtype":"float32"},{"name":"batch_normalization_76/moving_variance","shape":[256],"dtype":"float32"},{"name":"batch_normalization_77/moving_mean","shape":[256],"dtype":"float32"},{"name":"batch_normalization_77/moving_variance","shape":[256],"dtype":"float32"}]}]}